# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelTypeSet..::..Insert Method
PanelTypeSet Class See Also
---
Insert the specified panel type into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	PanelType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As PanelType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	PanelType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PanelTypeThe panel type to be inserted into the set.
# ### Return Value
Returns whether the panel type was inserted into the set.
# See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace